Revit 2026 API

# ColumnAttachmentIsValidTarget(FamilyInstance, Element) Method

---

Says whether the element can be used as a target for a new attachment.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidTarget(
	FamilyInstance column,
	Element target
)
```
```vb
Public Shared Function IsValidTarget (
	column As FamilyInstance,
	target As Element
) As Boolean
```
```cpp
public:
static bool IsValidTarget(
	FamilyInstance^ column,
	Element^ target
)
```
```fsharp
static member IsValidTarget :
        column : FamilyInstance *
        target : Element -> bool
```

#### Parameters

column FamilyInstance
     The column to attach. If the target is a beam or brace, the column will be checked to see if it is slanted. Otherwise, this argument is not used and may be omitted.
target Element
     A proposed target element for a column attachment.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Valid targets are roofs, floors, and ceilings. Beams and braces are also valid targets, except for slanted columns.

#### Reference

ColumnAttachment Class

IsValidTarget Overload

Autodesk.Revit.DB Namespace